TargetApplication=HoMM5MapScriptsEditor
Author=Sergey A. Klochkov
SourceLANGID=1049
LANGID=1033
Generator=DKLang Translation Editor v3.0
LastModified=2015-10-22 23:07:14

[EmbFileChooseDialog]
00000001=Select file
00000002=Cancel
00000003=Select
00000004=Preview

[H5MFrame]

[LuaFrame]
00000002=Check syntax
00000003=Revert to last saved
00000004=Save
00000005=Insert *.txt (filename)
00000006=Insert *.txt (filename)
00000007=Insert *.lua (filename)
00000008=Insert *.lua (filename)
00000009=Insert *.xdb (filename)
00000010=Insert *.xdb (filename)
00000011=Insert *.* (filename)
00000012=Insert *.* (filename)

[MainForm]
00000001=Heroes of Might and Magic V Map Scripts Editor
00000004=Exit
00000005=Exit
00000007=Find in Files...
00000008=Find in Files...
00000010=Print...
00000011=Print...
00000013=Undo
00000014=Undo
00000016=Redo
00000017=Redo
00000019=Select All
00000020=Select All
00000022=Cut
00000023=Cut
00000025=Copy
00000026=Copy
00000028=Paste
00000029=Paste
00000031=Find...
00000032=Find...
00000034=Find Next
00000035=Find Next
00000037=Replace...
00000038=Replace...
00000040=Go to Line Number...
00000041=Go to Line Number...
00000043=Editor Settings...
00000044=Editor Settings...
00000046=Unindent Selection
00000047=Unindent Selection
00000049=Indent Selection
00000050=Indent Selection
00000065=Comment Selection
00000066=Comment Selection
00000068=Uncomment Selection
00000069=Uncomment Selection
00000071=Upper Case Selection
00000072=Upper Case Selection
00000074=Lower Case Selection
00000075=Lower Case Selection
00000076=Close Page
00000077=Open map (*.h5m)
00000078=New *.txt
00000079=Toggle Bookmarks
00000080=Bookmark 1
00000081=Bookmark 2
00000082=Bookmark 3
00000083=Bookmark 4
00000084=Bookmark 5
00000085=Bookmark 6
00000086=Bookmark 7
00000087=Bookmark 8
00000088=Bookmark 9
00000089=Bookmark 0
00000090=Goto Bookmarks
00000091=Bookmark 1
00000092=Bookmark 2
00000093=Bookmark 3
00000094=Bookmark 4
00000095=Bookmark 5
00000096=Bookmark 6
00000097=Bookmark 7
00000098=Bookmark 8
00000099=Bookmark 9
00000100=Bookmark 0
00000101=File
00000102=Edit
00000103=Find...
00000104=Window
00000105=Help
00000107=Close All Other Pages
00000111=New *.lua
00000113=Delete file/folder
00000117=New folder
00000119=New *.txt
00000120=New *.lua
00000121=Delete file/folder
00000122=New folder
00000123=H5M Files (*.h5m)|*.h5m|All Files (*.*)|*.*
00000124=Open H5M File
00000125=Pages
00000126=Pages
00000127=Pages
00000128=Next Page
00000129=Pages
00000130=Previous Page
00000131=Refresh
00000132=About...
00000133=About...
00000134=Tools
00000137=Open map (*.h5m)
00000138=Close map
00000139=Close map
00000140=Settings
00000141=Settings
00000142=Spell check *.txt
00000143=Spell check *.txt
00000144=Help
00000145=Help
00000156=Files filter
00000157=Files filter
00000158=others
00000159=Open external file
00000160=Open external file
00000161=All Files (*.*)|*.*
00000162=Open external file
00000165=Refresh
00000166=Refresh
00000167=Close Page
00000168=Close All Other Pages
00000169=Next Page
00000170=Previous Page
00000172=Save
00000173=Save
00000174=Home Page
00000175=Home Page

[ReplaceForm]
00000001=Replace Text
00000002=&Text to find:
00000003=&Replace with:
00000004=Cancel
00000005=Scope
00000006=&Global\n&Selected text\n
00000007=Origin
00000008=&From cursor\n&Entire scope\n
00000009=Direction
00000010=Forwar&d\n&Backward\n
00000011=Options
00000012=&Case sensitive
00000013=&Whole words only
00000014=Regular e&xpression
00000015=&Promt on replace
00000016=Replace
00000017=Replace &All

[ReplaceQueryForm]
00000001=Replace?
00000002=&Yes
00000003=&No
00000004=Cancel
00000005=&All

[SearchForm]
00000001=Find Text
00000002=&Text to find:
00000003=Options
00000004=&Case sensitive
00000005=&Whole words only
00000006=&Regular expression
00000007=Direction
00000008=Forwar&d\n&Backward\n
00000009=Cancel
00000010=Scope
00000011=&Global\n&Selected text\n
00000012=Origin
00000013=&From cursor\n&Entire scope\n
00000014=Find

[SettingsForm]
00000001=Settings
00000003=On load map
00000004=Load map.xdb
00000005=Load MapScript.lua
00000006=Expand folders
00000007=No\nOnly map root\nMap root + all nested\nAll\n
00000010=Languages
00000012=OK
00000013=OK
00000014=Cancel
00000015=Cancel
00000017=LUA-editor
00000020=Use "GetMapDataPath().."
00000022=Paths
00000023=HoMM5 folder
00000024=Show parameters extended info

[TxtFrame]
00000002=Revert to last saved
00000003=Revert to last saved
00000004=Save
00000005=Save
00000006=Word wrap
00000007=Word wrap
00000011=&Add Word To Dictionary

[UnkFrame]
00000001=Mode
00000002=Text
00000003=Binary
00000004=Hex
00000005=Unicode
00000006=Content
00000007=No file loaded

[XMLFrame]
00000001=Tree
00000002=Text
00000003=Tree
00000004=Filter
00000005=Text
00000006=Elements/Attributes
00000007=Values
00000008=Elements/Attributes/Values
00000009=XPath

[AboutForm]
00000001=About...
00000002=Heroes of Might and Magic 5 Map Scripts Editor
00000004=Author:
00000006=Joint Authors:
00000009=OK

[SearchInFilesForm]
00000001=Find in Files...
00000014=Find
00000015=Text to find:
00000016=Options
00000017=Case sensitive
00000018=Whole words only
00000019=Regular expression
00000021=Files
00000026=Scripts (*.lua)
00000027=XDB-files (*.xdb)
00000028=Texts (*.txt)
00000029=Other files
00000030=Close

[$CONSTANTS]
SADD_WORD_TO_DICT_FMT=&Add Word '%s' To Dictionary
SASK_REPLACE_TEXT_FMT=Replace "%s" to "%s"?
SAUTOCOMPLETE_TITLE=Functions and variables
SBLANK_SEARCH_STRING_WARNING=The search string cannot be blank.
SCAN_CLOSE_ALL_FILES=Are you sure you want to close pages w/o save?
SCAN_CLOSE_MAP=Are you sure you want to close map w/o save?
SCAPTION_DIR_FILENAME=New folder
SCAPTION_LUA_FILENAME=New *.lua
SCAPTION_TXT_FILENAME=New *.txt
SCONF_DEL_FILE_FMT=Remove "%s" ?
SERROR_DIR_FILENAME=Invalid foldername.
SERROR_LUA_FILENAME=Invalid filename.
SERROR_TXT_FILENAME=Invalid filename.
SFILE_NOT_FOUND=File not found.
SFILE_NOT_FOUND_FMT=File "%s" not found.
SFILE_UNDO_CHANGES=Are you sure you want to revert to last saved state?
SGOTO_TEXT=Line Number:
SGOTO_TITLE=Go to Line Number
SHEADER_MAP_LABEL=Map:
SHELP_FILENAME=help_en.chm
SHMM5A1_TITLE=Heroes of Might and Magic V: Hammers of Fate
SHMM5A2_TITLE=Heroes of Might and Magic V: Tribes of the East
SHMM5_TITLE=Heroes of Might and Magic V
SLUA_ERROR_FMT=[Error]: %s (line: %u) - %s
SLUA_HINT_FMT=[Hint]:  Syntax checked - %s
SLUA_LUA5_WARN_FMT=[Compatibility with LUA 5]: %s (line: %u) - %s
SMOD_FILE_CLOSE_FMT=Are you sure you want to close "%s" w/o save?
SOPEN_FILE_ERROR_FMT=Error processing %s
SOPEN_ZIPFILE_ERROR_FMT=Open file "%s" error.
SOPTIONS_COMMONS=Common
SOPTIONS_EDITORS=Editors
SOPTIONS_LANG=Languages
SOPTIONS_PATHS=Paths
SPROMT_DIR_FILENAME=Name:
SPROMT_LUA_FILENAME=Name:
SPROMT_TXT_FILENAME=Name:
SSEARCH_IN_FILES_LINE=Line
SSEARCH_TREE_HEADER=File
SSTRING_NOT_FOUND_FMT=Search string "%s" not found.
STREE_INCSEARCH=Find:
SUNKNOWN=Unknown
SVERSION=Version
SWITHOUT_PARAMS=* no parameters *
